#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.prodaws: Refreshing state... [id=60106109e9febe3ecf90a896]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=6010610ae9febe3ed7c7598b]
spectrocloud_cluster_profile.dev-gcp: Refreshing state... [id=6010610ae9febe3edbe4751f]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=6011089de9febeb60e08c2b6]
spectrocloud_cluster_profile.devvmware: Refreshing state... [id=6010610ae9febe3edef14b9a]
spectrocloud_cluster_profile.azure: Refreshing state... [id=6010610ae9febe3eda2c7612]
spectrocloud_cluster_aws.cluster: Refreshing state... [id=6010610ae9febe3ee228d7ed]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=6011bdecef54a3912411f918]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=6010ce30e9febe8bd05a9979]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=6010610ae9febe3eecb7a00f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spectrocloud_cluster_aws.cluster2 will be created
  + resource "spectrocloud_cluster_aws" "cluster2" {
      + cloud_account_id   = "60010f4a042c47c320ef22a5"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60106109e9febe3ecf90a896"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "aws-picard-4"

      + cloud_config {
          + region       = "us-west-2"
          + ssh_key_name = "default"
        }

      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + disk_size_gb            = 65
          + instance_type           = "t3.large"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"
        }
      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + disk_size_gb            = 62
          + instance_type           = "t3.large"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*